[
    {
      "nom": "Booki",
      "image":"/projets/image_booki.png",
      "description": "Créer la page d'accueil d'une agence de voyage en utilisant HTML et CSS. La mission était d'intégrer l'interface responsive de leur site. ",
      "lien": "https://github.com/hajarbnh33/Projet_2_booki/tree/main/Bensrhayar_Hajar_1_code_201123",
      "hard":"La difficulté dans ce projet était de travailler avec Flexbox, mais quand on comprend son focntionnement cela devient très pratique.",
      "technologies":"HTML, CSS, Figma"
    },
    {
      "nom": "Sophie Bluel",
      "image":"projets/image_sophie.png",
      "description": "La mission était de créer une page web dynamique pour le site internet d'une architecte d'intérieur en utilisant JavaScript et en communiquant avec une API.",
      "lien": "https://github.com/hajarbnh33/Projet-3-archi-webos",
      "hard":"La difficulté résidait dans l'utilisation du langage Javascript et notemment les apels vers l'API. Après avoir pratiqué et suivi les exemples, j'ai réussi à surmonter cette épreuve et j'ai trouvé cela très passionnant.",
      "technologies":"Javascript, API"
    },
    {
      "nom": "Mon Vieux Grimoire",
      "image":"projets/image_vieux.png",
      "description": "Mon rôle était de créer un serveur avec Express et de le connecter à une base de données MongoDB. Cela impliquera la mise en place de la structure du serveur et la gestion de la communication entre le serveur et la base de données",
      "lien": "https://github.com/hajarbnh33/P7-Dev-Web-livres-1",
      "hard":"La difficulté se trouvait dans la compréhension du fonctionnement Back-end. L'apprentissage de nouveaux langages et outils. La meilleure façon de faire était de pratiquer pour comprendre l'utilisation des divers langages.",
      "technologies":"NodeJs, Express, MongoDB, Moongoose, "
    },
    {
      "nom": "Kasa",
      "image":"projets/image_kasa.png",
      "description": "Mon rôle était d'implémenter le front-end d’une application en utilisant React et React Router pour créer une expérience utilisateur moderne et réactive.",
      "lien": "https://github.com/hajarbnh33/React_Projet_6",
      "hard":"Le fonctionnement des composants, mais la logique est très simple et ludique.",
      "technologies":"React, React router, JSON, Javascript, CRA, Nodejs"
    },
    {
      "nom": "Nina Carducci",
      "image":"projets/image_nina.png",
      "description": "Mon rôle était d'optimiser le référencement d’un site, en améliorant sa performance et son accessibilité.",
      "lien": "https://github.com/hajarbnh33/Nina-carducci-p5",
      "hard":"L'optimisation d'images avec un poid important. Des outils m'ont permis de recarder chaque image et contribuer à la performance du site.",
      "technologies":"meta, google rich result, SEO, webp, wave, lighthouse, Schema.org"
    },
    {
      "nom": "Météo en temps réel",
      "image":"projets/image_weather.png",
      "description": "Création d'une application météo en temps réel. J'ai fais appel à une API publique me permettant d'obtenir les informations en temps réel sur toutes les villes du monde.",
      "lien": "https://github.com/hajarbnh33/weather",
      "hard":"Appel à une API publique.",
      "technologies":"Axios, React, JS, Api, CRA, Npx"
    },
    {
      "nom": "Shop Chic",
      "image":"projets/image_shochic.png",
      "description": "Création site e-commerce toujours en cours de développement. L'objectif est d'y insérer une API permettant le paiment des utilisateurs, l'ajout d'articles dans le panier.",
      "lien": "https://github.com/hajarbnh33/shopchic",
      "hard":"Appel à une API paiement.",
      "technologies":"Reactjs, JS, Api, CRA, Npx"
    }
  ]